<template>
	<f7-page navbar-fixed class="agreement">
	    <f7-navbar sliding>
          <f7-nav-left>
			<f7-link icon-only back>
				<i class="iconfont icon-back">

				</i>
			</f7-link>
          </f7-nav-left>
          <f7-nav-center>
          	用户注册协议
          </f7-nav-center>
          <f7-nav-right>
          	
          </f7-nav-right>            
	    </f7-navbar>
        <div class="content">
            <div class="block">
                <div class="subtitle">
                    <h2>一、协议条款的确认及接受</h2>
                </div>
                <p>1.1 格物志（包括网址为 www.grozii.com 的网站，以及可在 iOS 系统及Android 系统中运行的名为「格物志」的应用程序，以下简称「本网站」或「格物志」）由成都邑动科技有限公司（包括其关联机构，以下合称「本公司」）运营并享有完全的所有权及知识产权等权益。格物志提供的服务将完全按照其发布的条款和操作规则严格执行。</p>
                <p>1.2 用户在注册之前，应当仔细阅读本协议，并同意遵守本协议后方可成为注册用户。一旦注册成功，则用户与格物志之间自动形成协议关系，用户应当受本协议的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。 </p>
                <p>1.3 根据国家法律法规变化及本网站运营需要，本公司有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本网站上即生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。</p>                  
            </div>   
            <div class="block">
                <div class="subtitle">
                    <h2>二、版权说明</h2>
                </div>
                <p>2.1 本网站上刊载的所有内容以及本网站用户发表并授权刊载于本网站的所有内容，包括但不限于文字、图片、声音、视频、图表、标志、标识、广告、商标、商号、域名、软件、程序、数据、数据文件、发现、发明、作品、设计、技术、方法、流程、计划、公式、专栏目录与名称、内容分类标准、过去、目前和计划的研究开发成果以及任何其他信息或资料，均受中国现行法律法规、规章制度及适用之国际公约中有关著作权、商标权、专利权及／或其它财产所有权法律的保护，为本公司所有。使用者将本网站上刊载的内容与服务用于商业、盈利、广告性目的时，需征得本公司的书面特别授权，注明作者及文章出处并按有关规定支付相应费用。未经本公司的明确书面特别授权，任何人不得为任何目的使用以及向任何自然人或单位提供、披露、复印、复制、出售、出让、许可、营销、出版、宣讲、转让、处置或利用本网站上提供的任何内容或服务，或在非本公司所属的服务器上作镜像，否则本公司将依据相关法律法规追究经济赔偿和其它侵权法律责任。</p>
                <p>2.2 在格物志张贴的公开信息：</p>
                <p>在本协议中，「本服务公开使用区域」系指一般公众可以使用的区域。</p>
                <p>用户同意已就用户于本服务公开使用区域及本服务其它任何公开使用区域张贴之内容，包括照片、文字或影音资料等内容，不可撤销地授予格物志全球性、永久性的、免许可费及非独家的使用权，格物志可以为了展示、散布及推广张贴前述内容之特定服务目的，将前述内容复制、修改、改写、改编或出版，对于照片及文字影音资料的上述使用，仅为张贴该照片或文字影音于本服务之目的而为之。</p>
                <p>用户同意已就用户于本服务其它公开使用区域张贴的其它内容，授予格物志免许可费、永久有效、不可撤销、非独家及可完全再授权之权利在全球使用、复制、修改、改写、改编、发行、翻译、创造衍生性著作，及/或将前述内容（部分或全部）加以散布、表演、展示，及/ 或放入利用任何现在已知和未来开发出之形式、媒体和科技之其它著作物当中。</p>
                <p>本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。 </p>
                <p>2.3 对恶意使用本网站内容者，本公司保留追究其法律责任的权利。</p>                  
            </div>                           
            <div class="block">
                <div class="subtitle">
                    <h2>三、服务内容</h2>
                </div>
                <p>3.1 本网站的服务具体内容由格物志根据实际情况提供，格物志保留随时变更、中断或终止部分或全部服务的权利。格物志不承担因业务调整给用户造成的损失。除非本协议另有其它明示规定，增加或强化目前本网站的任何新功能，包括所推出的新产品，均受到本协议之规范。用户了解并同意，本网站服务仅依其当前所呈现的状况提供，对于任何用户通讯或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，格物志均不承担任何责任。</p>
                <p>3.2 用户理解，格物志仅提供相关的服务，除此之外与相关服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。</p>                  
            </div>   
            <div class="block">
                <div class="subtitle">
                    <h2>四、用户帐号</h2>
                </div>
                <p>4.1 用户注册成功后，格物志将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
                <p>4.2 用户须对在格物志的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐户导致其他用户误认；否则格物志有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。</p>                  
            </div>   
            <div class="block">
                <div class="subtitle">
                    <h2>五、使用规则</h2>
                </div>
                <p>5.1 遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法。 </p>
                <p>5.2 用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在本站任何页面发布、转载、传送含有下列内容之一的信息，否则本站有权自行处理并不通知用户：</p>
                <p>(1)违反宪法确定的基本原则的； </p>
                <p>(2)危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的； </p>
                <p>(3)损害国家荣誉和利益的； </p>
                <p>(4)煽动民族仇恨、民族歧视，破坏民族团结的； </p>
                <p>(5)破坏国家宗教政策，宣扬邪教和封建迷信的； </p>
                <p>(6)散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
                <p>(7)散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的； </p>
                <p>(8)侮辱或者诽谤他人，侵害他人合法权益的； </p>
                <p>(9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； </p>
                <p>(10)以非法民间组织名义活动的；</p>
                <p>(11)含有法律、行政法规禁止的其他内容的。</p>
                <p>5.3 用户承诺对其发表或者上传于本站的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；若第三方向格物志投诉并提交初步证据的，经格物志判断投诉属实的，格物志将会删除这些内容，如因用户发布内容给格物志带来损失的，用户应当负责赔偿。； </p>
                <p>5.4如用户在使用网络服务时违反上述任何规定，格物志有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户张贴的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。</p>                  
            </div>   

            <div class="block">
                <div class="subtitle">
                    <h2>六、隐私保护</h2>
                </div>
                <p>6.1 格物志不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本站的非公开内容，但下列情况除外：</p>
                <p>(1)事先获得用户的明确授权； </p>
                <p>(2)根据有关的法律法规要求；</p>
                <p>(3)按照相关政府主管部门的要求；</p>
                <p>(4)为维护社会公众的利益。</p>
                <p>6.2 本站可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本站同等的保护用户隐私的责任，则本站有权将用户的注册资料等提供给该第三方。</p>
                <p>6.3 在不透露单个用户隐私资料的6.1 格物志不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本站的非公开内容，但下列情况除外：</p>
                <p>(1)事先获得用户的明确授权； </p>
                <p>(2)根据有关的法律法规要求；</p>
                <p>(3)按照相关政府主管部门的要求；</p>
                <p>(4)为维护社会公众的利益。</p>
                <p>6.2 本站可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本站同等的保护用户隐私的责任，则本站有权将用户的注册资料等提供给该第三方。</p>
                <p>6.3 在不透露单个用户隐私资料的前提下，本站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。前提下，本站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>                  
            </div>   
            <div class="block">
                <div class="subtitle">
                    <h2>七、免责声明</h2>
                </div>
                <p>7.1 用户将照片、个人信息等资料上传到互联网上，有可能会被其他组织或个人复制、转载、擅改或做其它非法用途，用户必须充分意识此类风险的存在。用户明确同意其使用格物志服务所存在的风险（包括但不限于受到第三方侵权或对第三方造成侵权）将完全由其自己承担；因其使用格物志服务而产生的一切后果也由其自己承担，格物志对此不承担任何责任。</p>
                <p>7.2 格物志不担保本网站服务一定能满足用户的要求，也不担保本网站服务不会中断，对本网站服务的及时性、安全性、准确性、真实性、完整性也都不作担保。</p>
                <p>7.3 对于因不可抗力或格物志不能控制的原因造成的本网站服务中断或其它缺陷，格物志不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
                <p>7.4 根据有关法律法规，格物志在此郑重提请用户注意，任何经由本网站以上载、张贴、发送电子邮件或任何其它方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息或其它资料（以下简称「内容」），无论系公开还是私下传送，均由内容提供者承担责任。格物志无法控制经由本网站传送之内容，因此不保证内容的正确性、完整性或品质。在任何情况下，格物志均不为任何内容负责，包含但不限于任何内容之任何错误或遗漏，以及经由本网站服务以张贴、发送电子邮件或其它方式传送任何内容而衍生之任何损失或损害。但格物志有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本网站服务的全部或部分，保存有关记录，并向有关机关报告。</p>
                <p>7.5 格物志作为网络服务提供者，对非法转载，虚假发布、盗版行为的发生不具备充分的监控能力。格物志对他人在网站上实施的此类侵权行为不承担法律责任，侵权的法律责任概由本人承担。</p>                  
            </div>
            <div class="block">
                <div class="subtitle">
                    <h2>八、附则</h2>
                </div>
                <p>8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。 </p>
                <p>8.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
                <p>8.3 本协议解释权及修订权归成都邑动科技有限公司所有。</p>               
            </div>                                       
        </div>
	</f7-page>
</template>
<style lang="less">
.agreement{
    .page-content{
        background-color: #fff!important;
    }    
	h1,h2,p{
		font-size: inherit;
	}
	.content{
		padding: 20px .4rem;
		.title{
			font-size: 16px;
			line-height: 2;
			text-align: center;
		}
		.subtitle{
			font-size: 14px;
			line-height: 2;
			color: #333;
		}
		p{
			font-size: 12px;
			line-height: 1.5;
			color: #666;
		}
	}
}
</style>
<script>
export default {
	mounted(){
		
	},
    beforeCreate(){
        plus.navigator.setStatusBarStyle("dark");
    },
    beforeDestroy(){ 
        plus.navigator.setStatusBarStyle("light");

    },    
	methods:{
		openLogin(){
			this.$store.commit("COM_CONF",{
				isLoginScreenShow:true
			})
		}
	}
}
</script>